/*
מכילה את שיטת `main`, המשמשת כנקודת הכניסה לתוכנית. כאשר הוא מבצע, הוא יוצר מופע של המחלקה `GameWindow`, מפעיל את חלון המשחק ומתחיל את המשחק.
בסך הכל, השיטה 'הראשית' פועלת כנקודת ההתחלה של התוכנית, מאתחלת את חלון המשחק ומאפשרת למשתמש אינטראקציה עם המשחק או להיכנס למצב ניתוח אסטרטגיה על סמך העדפותיו.
 */
public class Ingenious extends GameWindow {
    /* - יוצר מופע של מחלקת `GameWindow` בשם `gameWindow`.
       - הבנאי `GameWindow` מאתחל את חלון המשחק ומרכיביו, מציג את חלונית ההתחלה כדי לאפשר למשתמש להגדיר את המשחק.
       - בהתאם לקלט של המשתמש (בין אם הוא בוחר להתחיל משחק או להיכנס למצב ניתוח אסטרטגיה), מחלקת `GameWindow` ממשיכה לאתחל את המשחק או ניתוח האסטרטגיה בהתאם.
    */
    public static void main(String[] args){
        new GameWindow();
    }
}
